app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"
---
  def index
    @posts = Post.paginate(page: params[:page], per_page: 10)

UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "You have called death upon yourself. And I'm calling ur mom for a gud time lol"], ["updated_at", "2019-06-18 19:10:04.828350"], ["id", 7]]
---
  def update
    # @post = Post.find(params[:id])
    # if @post.update_attributes(post_params)
    #   flash[:success] = "Profile Updated"
    #   redirect_to posts_path
    # else
    #   render "edit"
    # end
    respond_to do |format|
      if @post.update(post_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
  def destroy
    @post = Post.find(params[:id])