app/controllers/relationships_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
INSERT INTO "relationships" ("follower_id", "followed_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 105], ["followed_id", 8], ["created_at", "2019-07-02 13:23:41.324117"], ["updated_at", "2019-07-02 13:23:41.324117"]]
---
  def create
    user = User.find(params[:followed_id])
    current_user.active_relationships.create!(followed_id: user.id)

SELECT  "relationships".* FROM "relationships" WHERE "relationships"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 7]]
---
  def destroy
    user = Relationship.find(params[:id]).followed
    current_user.active_relationships.find_by(followed_id: user.id).destroy