app/controllers/users_controller.rb

  def index
    @users = User.paginate(page: params[:page], :per_page => 10) # or per_page: 10
---
SELECT  "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"

  def create
    user = User.new(user_params) # user or @user are the same

    # respond_to do |format|
    #   if @user.save
    #     format.html { redirect_to @user, notice: 'User was successfully created.' }
    #     format.json { render :show, status: :created, location: @user }
    #   else
    #     format.html { render :new }
    #     format.json { render json: @user.errors, status: :unprocessable_entity }
    #   end
    # end

    if user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "activation_digest") VALUES (?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "viet1000@gmail.com"], ["password_digest", "$2a$10$eg7F/7B.ojkbD7ukbbtyr.Kd9JKdXvtBJ4JydrLOkm2VusSAR.LW6"], ["updated_at", "2019-06-17 11:50:02.581899"], ["id", 4]]